cfd_examples/round/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/ABLConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{
    #include        "include/ABLConditions"

    inletOutlet
    {
        type            atmBoundaryLayerInletEpsilon;
	#include        "include/ABLConditions"
        value           uniform $epsilonInlet;
    }

    top
    {
	type		symmetry;
    }

    Terrain
    {
        type            atmEpsilonWallFunction;
	#include        "include/ABLConditions"
	z0		$z0;
        value           uniform $epsilonInlet;
    }

    "(Water|Ocean)"
    {
        type            atmEpsilonWallFunction;
	#include        "include/ABLConditions"
	z0		$z0water;
        value           uniform $epsilonInlet;
    }

    Vegetation
    {
        type            atmEpsilonWallFunction;
	#include        "include/ABLConditions"
	z0		$z0vegetation;
        value           uniform $epsilonInlet;
    }

    Forest
    {
        type            atmEpsilonWallFunction;
	#include        "include/ABLConditions"
	z0		$z0forest;
        value           uniform $epsilonInlet;
    }

    Buildings
    {
        type            epsilonWallFunction;
	#include        "include/ABLConditions"
        value           uniform $epsilonInlet;
    }

}

// ************************************************************************* //
