cfd_examples/round/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inletOutlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions";
        z0		$z0;
        value           uniform $kInlet;
    }


    top
    {
	type		symmetry;
    }

    "(Buildings|Terrain|Water|Forest|Vegetation|Ocean)"
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

}

// ************************************************************************* //
